return {
  "folke/snacks.nvim",
  opts = {
    scroll = {
      enabled = false, -- Disable scrolling animations
    },
    dashboard = {
      preset = {
        header = [[
           ██╗  ██╗██╗   ██╗██╗██████╗ ██████╗           Z
           ██║ ██╔╝██║   ██║██║╚════██╗╚════██╗      Z    
           █████╔╝ ██║   ██║██║ █████╔╝ █████╔╝   z       
           ██╔═██╗ ██║   ██║██║ ╚═══██╗ ╚═══██╗ z         
           ██║  ██╗╚██████╔╝██║██████╔╝██████╔╝           
           ╚═╝  ╚═╝ ╚═════╝ ╚═╝╚═════╝ ╚═════╝            
    ]],
      },
    },
  },
}
